stress_testing/get.yml
config:
  target: 'http://localhost:3000'
  http:
    timeout: 10
  phases:
    - duration: 5
      arrivalRate: 1
      name: test
    - duration: 60
      arrivalRate: 10
      name: low
    - duration: 60
      arrivalRate: 100
      name: medium
    - duration: 60
      arrivalRate: 150
      name: medium-high
    - duration: 60
      arrivalRate: 200
      name: medium-high-2
    - duration: 60
      arrivalRate: 1000
      name: high
  processor: './functions.js'

scenarios:
  - flow:
    - get:
        url: '/product-features'
        beforeRequest: 'setUrlWithProductId'